{"format": "graph-model", "generatedBy": "2.12.0", "convertedBy": "TensorFlow.js Converter v4.6.0", "signature": {"outputs": {"Identity": {"name": "Identity"}}}, "modelTopology": {"node": [{"name": "PartitionedCall/model_1/rnn_2/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "18281", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}}}, {"name": "18275", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}}}, {"name": "18279", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "31"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "18273", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}}}, {"name": "PartitionedCall/model_1/rnn_2/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "18267", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "18269", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "31"}, {"size": "64"}]}}}}}, {"name": "18271", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}}, {"name": "18277", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_2/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_1/rnn_2/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_1/rnn_2/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "PartitionedCall/model_1/rnn_2/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/model_1/tf.expand_dims_6/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_1/rnn_3/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "18265", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}}}, {"name": "18259", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "18263", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "31"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "18257", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}}}, {"name": "PartitionedCall/model_1/rnn/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "18249", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "18243", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}}}, {"name": "18247", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "31"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "18241", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}}}, {"name": "PartitionedCall/model_1/rnn/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "18235", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "18237", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "31"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "18239", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "18245", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}}}, {"name": "PartitionedCall/model_1/rnn/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/rnn/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/rnn/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/rnn/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/rnn/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/model_1/tf.expand_dims/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_1/rnn_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "18233", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}}}, {"name": "18227", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}}}, {"name": "18231", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "31"}, {"size": "64"}]}}}}}, {"name": "18225", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}}}, {"name": "18191", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "18193", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}}}, {"name": "18195", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "18197", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "18199", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}}}, {"name": "18201", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "18203", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}}}, {"name": "18205", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "18207", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "18209", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "18211", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "18213", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "18215", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "256"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "18217", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/tf.compat.v1.transpose/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/model_1/tf.reshape/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/model_1/rnn_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "18219", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}}, {"name": "18221", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "31"}, {"size": "64"}]}}}}}, {"name": "18223", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}}, {"name": "18229", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}}}, {"name": "PartitionedCall/model_1/rnn_1/time", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/rnn_1/strided_slice", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_1/rnn_1/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_1/rnn_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "PartitionedCall/model_1/rnn_1/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/model_1/tf.expand_dims_1/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_1/tf.concat/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/tf.compat.v1.transpose_3/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/model_1/tf.compat.v1.transpose_4/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/tf.reshape_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/rnn_3/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "18251", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "256"}]}}}}}, {"name": "18253", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "31"}, {"size": "64"}]}}}}}, {"name": "18255", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "18261", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_3/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_1/rnn_3/strided_slice", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_1/rnn_3/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_1/rnn_3/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/rnn_3/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/tf.expand_dims_7/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/tf.concat_3/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/tf.compat.v1.transpose_6/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/tf.compat.v1.transpose_7/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/model_1/tf.reshape_2/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "18283", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}}}, {"name": "18285", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/output/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "x", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "1"}, {"size": "32"}, {"size": "128"}, {"size": "1"}]}}}}, {"name": "PartitionedCall/model_1/rnn_2/while/enter/_290", "op": "Enter", "input": ["18281"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzIvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/enter/_288", "op": "Enter", "input": ["18275"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzIvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/enter/_282", "op": "Enter", "input": ["18279"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzIvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/enter/_287", "op": "Enter", "input": ["18273"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzIvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/enter/_285", "op": "Enter", "input": ["18267"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzIvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/enter/_281", "op": "Enter", "input": ["18269"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzIvd2hpbGU="}}}, {"name": "PartitionedCall/model_1/rnn_2/while/enter/_286", "op": "Enter", "input": ["18271"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzIvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/enter/_289", "op": "Enter", "input": ["18277"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzIvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_1/rnn_2/while/enter/_279", "op": "Enter", "input": ["PartitionedCall/model_1/rnn_2/time"], "attr": {"T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzIvd2hpbGU="}}}, {"name": "PartitionedCall/model_1/rnn_2/TensorArrayV2_1", "op": "TensorListReserve", "input": ["PartitionedCall/model_1/rnn_2/TensorArrayV2_1/element_shape", "PartitionedCall/model_1/rnn_2/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "PartitionedCall/model_1/rnn_2/while/enter/_283", "op": "Enter", "input": ["PartitionedCall/model_1/rnn_2/strided_slice"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzIvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/enter/_277", "op": "Enter", "input": ["PartitionedCall/model_1/rnn_2/while/loop_counter"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzIvd2hpbGU="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_1/rnn_3/while/enter/_215", "op": "Enter", "input": ["18265"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzMvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_1/rnn_3/while/enter/_213", "op": "Enter", "input": ["18259"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzMvd2hpbGU="}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_3/while/enter/_207", "op": "Enter", "input": ["18263"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzMvd2hpbGU="}}}, {"name": "PartitionedCall/model_1/rnn_3/while/enter/_212", "op": "Enter", "input": ["18257"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzMvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn/while/enter/_140", "op": "Enter", "input": ["18249"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uL3doaWxl"}}}, {"name": "PartitionedCall/model_1/rnn/while/enter/_138", "op": "Enter", "input": ["18243"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uL3doaWxl"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_1/rnn/while/enter/_132", "op": "Enter", "input": ["18247"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uL3doaWxl"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_1/rnn/while/enter/_137", "op": "Enter", "input": ["18241"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uL3doaWxl"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_1/rnn/while/enter/_135", "op": "Enter", "input": ["18235"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_1/rnn/while/enter/_131", "op": "Enter", "input": ["18237"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uL3doaWxl"}}}, {"name": "PartitionedCall/model_1/rnn/while/enter/_136", "op": "Enter", "input": ["18239"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_1/rnn/while/enter/_139", "op": "Enter", "input": ["18245"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_1/rnn/while/enter/_129", "op": "Enter", "input": ["PartitionedCall/model_1/rnn/time"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uL3doaWxl"}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_1/rnn/TensorArrayV2_1", "op": "TensorListReserve", "input": ["PartitionedCall/model_1/rnn/TensorArrayV2_1/element_shape", "PartitionedCall/model_1/rnn/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "PartitionedCall/model_1/rnn/while/enter/_133", "op": "Enter", "input": ["PartitionedCall/model_1/rnn/strided_slice"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uL3doaWxl"}}}, {"name": "PartitionedCall/model_1/rnn/while/enter/_127", "op": "Enter", "input": ["PartitionedCall/model_1/rnn/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uL3doaWxl"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/enter/_65", "op": "Enter", "input": ["18233"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/enter/_63", "op": "Enter", "input": ["18227"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzEvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/enter/_57", "op": "Enter", "input": ["18231"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzEvd2hpbGU="}}}, {"name": "PartitionedCall/model_1/rnn_1/while/enter/_62", "op": "Enter", "input": ["18225"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/enter/_60", "op": "Enter", "input": ["18219"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/enter/_56", "op": "Enter", "input": ["18221"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/enter/_61", "op": "Enter", "input": ["18223"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/enter/_64", "op": "Enter", "input": ["18229"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzEvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/enter/_54", "op": "Enter", "input": ["PartitionedCall/model_1/rnn_1/time"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_1/rnn_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["PartitionedCall/model_1/rnn_1/TensorArrayV2_1/element_shape", "PartitionedCall/model_1/rnn_1/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "PartitionedCall/model_1/rnn_1/while/enter/_58", "op": "Enter", "input": ["PartitionedCall/model_1/rnn_1/strided_slice"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_1/rnn_1/while/enter/_52", "op": "Enter", "input": ["PartitionedCall/model_1/rnn_1/while/loop_counter"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_1/rnn_3/while/enter/_210", "op": "Enter", "input": ["18251"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzMvd2hpbGU="}}}, {"name": "PartitionedCall/model_1/rnn_3/while/enter/_206", "op": "Enter", "input": ["18253"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzMvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_1/rnn_3/while/enter/_211", "op": "Enter", "input": ["18255"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzMvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_1/rnn_3/while/enter/_214", "op": "Enter", "input": ["18261"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzMvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_1/rnn_3/while/enter/_204", "op": "Enter", "input": ["PartitionedCall/model_1/rnn_3/time"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzMvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_1/rnn_3/TensorArrayV2_1", "op": "TensorListReserve", "input": ["PartitionedCall/model_1/rnn_3/TensorArrayV2_1/element_shape", "PartitionedCall/model_1/rnn_3/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "PartitionedCall/model_1/rnn_3/while/enter/_208", "op": "Enter", "input": ["PartitionedCall/model_1/rnn_3/strided_slice"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzMvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/rnn_3/while/enter/_202", "op": "Enter", "input": ["PartitionedCall/model_1/rnn_3/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzMvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_1/tf.nn.convolution/convolution", "op": "Conv2D", "input": ["x", "18191"], "device": "/device:CPU:0", "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "PartitionedCall/model_1/rnn_2/while/merge/_304", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_2/while/enter/_290", "PartitionedCall/model_1/rnn_2/while/next_iteration/_349"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/merge/_302", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_2/while/enter/_288", "PartitionedCall/model_1/rnn_2/while/next_iteration/_347"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/merge/_296", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_2/while/enter/_282", "PartitionedCall/model_1/rnn_2/while/next_iteration/_341"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/merge/_301", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_2/while/enter/_287", "PartitionedCall/model_1/rnn_2/while/next_iteration/_346"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/merge/_299", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_2/while/enter/_285", "PartitionedCall/model_1/rnn_2/while/next_iteration/_344"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/merge/_295", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_2/while/enter/_281", "PartitionedCall/model_1/rnn_2/while/next_iteration/_340"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/merge/_300", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_2/while/enter/_286", "PartitionedCall/model_1/rnn_2/while/next_iteration/_345"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/merge/_303", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_2/while/enter/_289", "PartitionedCall/model_1/rnn_2/while/next_iteration/_348"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/merge/_293", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_2/while/enter/_279", "PartitionedCall/model_1/rnn_2/while/next_iteration/_338"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/enter/_280", "op": "Enter", "input": ["PartitionedCall/model_1/rnn_2/TensorArrayV2_1"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzIvd2hpbGU="}}}, {"name": "PartitionedCall/model_1/rnn_2/while/merge/_297", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_2/while/enter/_283", "PartitionedCall/model_1/rnn_2/while/next_iteration/_342"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/merge/_291", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_2/while/enter/_277", "PartitionedCall/model_1/rnn_2/while/next_iteration/_336"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/rnn_3/while/merge/_229", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_3/while/enter/_215", "PartitionedCall/model_1/rnn_3/while/next_iteration/_274"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn_3/while/merge/_227", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_3/while/enter/_213", "PartitionedCall/model_1/rnn_3/while/next_iteration/_272"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_3/while/merge/_221", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_3/while/enter/_207", "PartitionedCall/model_1/rnn_3/while/next_iteration/_266"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_3/while/merge/_226", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_3/while/enter/_212", "PartitionedCall/model_1/rnn_3/while/next_iteration/_271"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn/while/merge/_154", "op": "Merge", "input": ["PartitionedCall/model_1/rnn/while/enter/_140", "PartitionedCall/model_1/rnn/while/next_iteration/_199"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn/while/merge/_152", "op": "Merge", "input": ["PartitionedCall/model_1/rnn/while/enter/_138", "PartitionedCall/model_1/rnn/while/next_iteration/_197"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn/while/merge/_146", "op": "Merge", "input": ["PartitionedCall/model_1/rnn/while/enter/_132", "PartitionedCall/model_1/rnn/while/next_iteration/_191"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn/while/merge/_151", "op": "Merge", "input": ["PartitionedCall/model_1/rnn/while/enter/_137", "PartitionedCall/model_1/rnn/while/next_iteration/_196"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn/while/merge/_149", "op": "Merge", "input": ["PartitionedCall/model_1/rnn/while/enter/_135", "PartitionedCall/model_1/rnn/while/next_iteration/_194"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn/while/merge/_145", "op": "Merge", "input": ["PartitionedCall/model_1/rnn/while/enter/_131", "PartitionedCall/model_1/rnn/while/next_iteration/_190"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn/while/merge/_150", "op": "Merge", "input": ["PartitionedCall/model_1/rnn/while/enter/_136", "PartitionedCall/model_1/rnn/while/next_iteration/_195"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn/while/merge/_153", "op": "Merge", "input": ["PartitionedCall/model_1/rnn/while/enter/_139", "PartitionedCall/model_1/rnn/while/next_iteration/_198"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn/while/merge/_143", "op": "Merge", "input": ["PartitionedCall/model_1/rnn/while/enter/_129", "PartitionedCall/model_1/rnn/while/next_iteration/_188"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn/while/enter/_130", "op": "Enter", "input": ["PartitionedCall/model_1/rnn/TensorArrayV2_1"], "attr": {"T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uL3doaWxl"}}}, {"name": "PartitionedCall/model_1/rnn/while/merge/_147", "op": "Merge", "input": ["PartitionedCall/model_1/rnn/while/enter/_133", "PartitionedCall/model_1/rnn/while/next_iteration/_192"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn/while/merge/_141", "op": "Merge", "input": ["PartitionedCall/model_1/rnn/while/enter/_127", "PartitionedCall/model_1/rnn/while/next_iteration/_186"], "attr": {"N": {"i": "2"}, "_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/merge/_79", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_1/while/enter/_65", "PartitionedCall/model_1/rnn_1/while/next_iteration/_124"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/merge/_77", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_1/while/enter/_63", "PartitionedCall/model_1/rnn_1/while/next_iteration/_122"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/merge/_71", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_1/while/enter/_57", "PartitionedCall/model_1/rnn_1/while/next_iteration/_116"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/merge/_76", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_1/while/enter/_62", "PartitionedCall/model_1/rnn_1/while/next_iteration/_121"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/merge/_74", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_1/while/enter/_60", "PartitionedCall/model_1/rnn_1/while/next_iteration/_119"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/merge/_70", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_1/while/enter/_56", "PartitionedCall/model_1/rnn_1/while/next_iteration/_115"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/merge/_75", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_1/while/enter/_61", "PartitionedCall/model_1/rnn_1/while/next_iteration/_120"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/merge/_78", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_1/while/enter/_64", "PartitionedCall/model_1/rnn_1/while/next_iteration/_123"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/merge/_68", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_1/while/enter/_54", "PartitionedCall/model_1/rnn_1/while/next_iteration/_113"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/enter/_55", "op": "Enter", "input": ["PartitionedCall/model_1/rnn_1/TensorArrayV2_1"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzEvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_VARIANT"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/merge/_72", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_1/while/enter/_58", "PartitionedCall/model_1/rnn_1/while/next_iteration/_117"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/merge/_66", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_1/while/enter/_52", "PartitionedCall/model_1/rnn_1/while/next_iteration/_111"], "attr": {"_has_manual_control_dependencies": {"b": true}, "T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn_3/while/merge/_224", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_3/while/enter/_210", "PartitionedCall/model_1/rnn_3/while/next_iteration/_269"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_3/while/merge/_220", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_3/while/enter/_206", "PartitionedCall/model_1/rnn_3/while/next_iteration/_265"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn_3/while/merge/_225", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_3/while/enter/_211", "PartitionedCall/model_1/rnn_3/while/next_iteration/_270"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn_3/while/merge/_228", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_3/while/enter/_214", "PartitionedCall/model_1/rnn_3/while/next_iteration/_273"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_3/while/merge/_218", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_3/while/enter/_204", "PartitionedCall/model_1/rnn_3/while/next_iteration/_263"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/rnn_3/while/enter/_205", "op": "Enter", "input": ["PartitionedCall/model_1/rnn_3/TensorArrayV2_1"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzEvcm5uXzMvd2hpbGU="}, "T": {"type": "DT_VARIANT"}}}, {"name": "PartitionedCall/model_1/rnn_3/while/merge/_222", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_3/while/enter/_208", "PartitionedCall/model_1/rnn_3/while/next_iteration/_267"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn_3/while/merge/_216", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_3/while/enter/_202", "PartitionedCall/model_1/rnn_3/while/next_iteration/_261"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/tf.math.add/Add", "op": "AddV2", "input": ["PartitionedCall/model_1/tf.nn.convolution/convolution", "18193"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/merge/_294", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_2/while/enter/_280", "PartitionedCall/model_1/rnn_2/while/next_iteration/_339"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/cond/_275/model_1/rnn_2/while/Less", "op": "Less", "input": ["PartitionedCall/model_1/rnn_2/while/merge/_293", "PartitionedCall/model_1/rnn_2/while/merge/_297", "^PartitionedCall/model_1/rnn_2/while/merge/_291"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/rnn/while/merge/_144", "op": "Merge", "input": ["PartitionedCall/model_1/rnn/while/enter/_130", "PartitionedCall/model_1/rnn/while/next_iteration/_189"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "PartitionedCall/model_1/rnn/while/cond/_125/model_1/rnn/while/Less", "op": "Less", "input": ["PartitionedCall/model_1/rnn/while/merge/_143", "PartitionedCall/model_1/rnn/while/merge/_147", "^PartitionedCall/model_1/rnn/while/merge/_141"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/merge/_69", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_1/while/enter/_55", "PartitionedCall/model_1/rnn_1/while/next_iteration/_114"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "PartitionedCall/model_1/rnn_1/while/cond/_50/model_1/rnn_1/while/Less", "op": "Less", "input": ["PartitionedCall/model_1/rnn_1/while/merge/_68", "PartitionedCall/model_1/rnn_1/while/merge/_72", "^PartitionedCall/model_1/rnn_1/while/merge/_66"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/rnn_3/while/merge/_219", "op": "Merge", "input": ["PartitionedCall/model_1/rnn_3/while/enter/_205", "PartitionedCall/model_1/rnn_3/while/next_iteration/_264"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_1/rnn_3/while/cond/_200/model_1/rnn_3/while/Less", "op": "Less", "input": ["PartitionedCall/model_1/rnn_3/while/merge/_218", "PartitionedCall/model_1/rnn_3/while/merge/_222", "^PartitionedCall/model_1/rnn_3/while/merge/_216"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_1/tf.nn.max_pool2d/MaxPool2d", "op": "MaxPool", "input": ["PartitionedCall/model_1/tf.math.add/Add"], "attr": {"explicit_paddings": {"list": {}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "PartitionedCall/model_1/rnn_2/while/LoopCond/_305", "op": "LoopCond", "input": ["PartitionedCall/model_1/rnn_2/while/cond/_275/model_1/rnn_2/while/Less"]}, {"name": "PartitionedCall/model_1/rnn/while/LoopCond/_155", "op": "LoopCond", "input": ["PartitionedCall/model_1/rnn/while/cond/_125/model_1/rnn/while/Less"]}, {"name": "PartitionedCall/model_1/rnn_1/while/LoopCond/_80", "op": "LoopCond", "input": ["PartitionedCall/model_1/rnn_1/while/cond/_50/model_1/rnn_1/while/Less"]}, {"name": "PartitionedCall/model_1/rnn_3/while/LoopCond/_230", "op": "LoopCond", "input": ["PartitionedCall/model_1/rnn_3/while/cond/_200/model_1/rnn_3/while/Less"]}, {"name": "PartitionedCall/model_1/tf.nn.relu/Relu", "op": "Relu", "input": ["PartitionedCall/model_1/tf.nn.max_pool2d/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/Func/PartitionedCall/input/_46_switch/_319", "op": "Switch", "input": ["PartitionedCall/model_1/rnn_2/while/merge/_304", "PartitionedCall/model_1/rnn_2/while/LoopCond/_305"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/Func/PartitionedCall/input/_43_switch/_317", "op": "Switch", "input": ["PartitionedCall/model_1/rnn_2/while/merge/_302", "PartitionedCall/model_1/rnn_2/while/LoopCond/_305"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/Func/PartitionedCall/input/_45_switch/_311", "op": "Switch", "input": ["PartitionedCall/model_1/rnn_2/while/merge/_296", "PartitionedCall/model_1/rnn_2/while/LoopCond/_305"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/Func/PartitionedCall/input/_42_switch/_316", "op": "Switch", "input": ["PartitionedCall/model_1/rnn_2/while/merge/_301", "PartitionedCall/model_1/rnn_2/while/LoopCond/_305"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/Func/PartitionedCall/input/_39_switch/_314", "op": "Switch", "input": ["PartitionedCall/model_1/rnn_2/while/merge/_299", "PartitionedCall/model_1/rnn_2/while/LoopCond/_305"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/Func/PartitionedCall/input/_40_switch/_310", "op": "Switch", "input": ["PartitionedCall/model_1/rnn_2/while/merge/_295", "PartitionedCall/model_1/rnn_2/while/LoopCond/_305"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/Func/PartitionedCall/input/_41_switch/_315", "op": "Switch", "input": ["PartitionedCall/model_1/rnn_2/while/merge/_300", "PartitionedCall/model_1/rnn_2/while/LoopCond/_305"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/Func/PartitionedCall/input/_44_switch/_318", "op": "Switch", "input": ["PartitionedCall/model_1/rnn_2/while/merge/_303", "PartitionedCall/model_1/rnn_2/while/LoopCond/_305"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_1/rnn_2/while/PartitionedCall/model_1/rnn_2/time_switch/_308", "op": "Switch", "input": 