{"format": "graph-model", "generatedBy": "2.12.0", "convertedBy": "TensorFlow.js Converter v4.6.0", "signature": {"outputs": {"Func/PartitionedCall/output/_49": {"name": "Func/PartitionedCall/output/_49"}}}, "modelTopology": {"node": [{"name": "PartitionedCall/model_2/rnn_2/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "869", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}}}, {"name": "863", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}}}, {"name": "867", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "31"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "861", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}}}, {"name": "PartitionedCall/model_2/rnn_2/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "855", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "256"}]}}}}}, {"name": "857", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "31"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "859", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "865", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_2/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_2/rnn_2/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn_2/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "PartitionedCall/model_2/rnn_2/transpose_1/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "PartitionedCall/model_2/tf.expand_dims_6/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn_3/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "853", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "847", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "851", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "31"}, {"size": "64"}]}}}}}, {"name": "845", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "837", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}}}, {"name": "831", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "835", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "31"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "829", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "823", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}}, {"name": "825", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "31"}, {"size": "64"}]}}}}}, {"name": "827", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}}, {"name": "833", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_2/rnn/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/tf.expand_dims/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_2/rnn_1/TensorArrayV2_1/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "821", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "815", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}}}, {"name": "819", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "31"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "813", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "779", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "1"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "781", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "783", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "785", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "787", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "789", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "791", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "793", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "795", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "128"}, {"size": "256"}]}}}}}, {"name": "797", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}}}, {"name": "799", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "256"}, {"size": "256"}]}}}}}, {"name": "801", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "803", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "2"}, {"size": "256"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "805", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "PartitionedCall/model_2/tf.compat.v1.transpose/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/tf.reshape/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn_1/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "807", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}}}, {"name": "809", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "31"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "811", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "817", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_1/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_2/rnn_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn_1/while/loop_counter", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_2/rnn_1/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn_1/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/tf.expand_dims_1/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_2/tf.concat/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_2/tf.compat.v1.transpose_3/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/tf.compat.v1.transpose_4/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/model_2/tf.reshape_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn_3/TensorArrayUnstack/TensorListFromTensor/element_shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "839", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "256"}]}}}}}, {"name": "841", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "31"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "843", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "849", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "64"}]}}}}}, {"name": "PartitionedCall/model_2/rnn_3/time", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_2/rnn_3/strided_slice", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_2/rnn_3/while/loop_counter", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn_3/TensorArrayV2Stack/TensorListStack/element_shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn_3/transpose_1/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/tf.expand_dims_7/ExpandDims/dim", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "PartitionedCall/model_2/tf.concat_3/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/tf.compat.v1.transpose_6/transpose/perm", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}}}, {"name": "PartitionedCall/model_2/tf.compat.v1.transpose_7/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/tf.reshape_2/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}}}, {"name": "871", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "873", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}}}, {"name": "PartitionedCall/model_2/output/transpose/perm", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "x", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "1"}, {"size": "32"}, {"size": "128"}, {"size": "1"}]}}}}, {"name": "PartitionedCall/model_2/rnn_2/while/enter/_290", "op": "Enter", "input": ["869"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzIvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_2/rnn_2/while/enter/_288", "op": "Enter", "input": ["863"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzIvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/enter/_282", "op": "Enter", "input": ["867"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzIvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_2/rnn_2/while/enter/_287", "op": "Enter", "input": ["861"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzIvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/enter/_285", "op": "Enter", "input": ["855"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzIvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_2/rnn_2/while/enter/_281", "op": "Enter", "input": ["857"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzIvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/enter/_286", "op": "Enter", "input": ["859"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzIvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/enter/_289", "op": "Enter", "input": ["865"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzIvd2hpbGU="}}}, {"name": "PartitionedCall/model_2/rnn_2/while/enter/_279", "op": "Enter", "input": ["PartitionedCall/model_2/rnn_2/time"], "attr": {"T": {"type": "DT_INT32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzIvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_2/rnn_2/TensorArrayV2_1", "op": "TensorListReserve", "input": ["PartitionedCall/model_2/rnn_2/TensorArrayV2_1/element_shape", "PartitionedCall/model_2/rnn_2/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "PartitionedCall/model_2/rnn_2/while/enter/_283", "op": "Enter", "input": ["PartitionedCall/model_2/rnn_2/strided_slice"], "attr": {"T": {"type": "DT_INT32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzIvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/enter/_277", "op": "Enter", "input": ["PartitionedCall/model_2/rnn_2/while/loop_counter"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzIvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_2/rnn_3/while/enter/_215", "op": "Enter", "input": ["853"], "attr": {"parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzMvd2hpbGU="}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_3/while/enter/_213", "op": "Enter", "input": ["847"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzMvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_2/rnn_3/while/enter/_207", "op": "Enter", "input": ["851"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzMvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_3/while/enter/_212", "op": "Enter", "input": ["845"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzMvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_2/rnn/while/enter/_140", "op": "Enter", "input": ["837"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_2/rnn/while/enter/_138", "op": "Enter", "input": ["831"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uL3doaWxl"}, "T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_2/rnn/while/enter/_132", "op": "Enter", "input": ["835"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uL3doaWxl"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_2/rnn/while/enter/_137", "op": "Enter", "input": ["829"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uL3doaWxl"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_2/rnn/while/enter/_135", "op": "Enter", "input": ["823"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uL3doaWxl"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_2/rnn/while/enter/_131", "op": "Enter", "input": ["825"], "attr": {"is_constant": {"b": false}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uL3doaWxl"}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn/while/enter/_136", "op": "Enter", "input": ["827"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uL3doaWxl"}}}, {"name": "PartitionedCall/model_2/rnn/while/enter/_139", "op": "Enter", "input": ["833"], "attr": {"T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_2/rnn/while/enter/_129", "op": "Enter", "input": ["PartitionedCall/model_2/rnn/time"], "attr": {"is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uL3doaWxl"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn/TensorArrayV2_1", "op": "TensorListReserve", "input": ["PartitionedCall/model_2/rnn/TensorArrayV2_1/element_shape", "PartitionedCall/model_2/rnn/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "PartitionedCall/model_2/rnn/while/enter/_133", "op": "Enter", "input": ["PartitionedCall/model_2/rnn/strided_slice"], "attr": {"T": {"type": "DT_INT32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uL3doaWxl"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_2/rnn/while/enter/_127", "op": "Enter", "input": ["PartitionedCall/model_2/rnn/while/loop_counter"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uL3doaWxl"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn_1/while/enter/_65", "op": "Enter", "input": ["821"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_2/rnn_1/while/enter/_63", "op": "Enter", "input": ["815"], "attr": {"parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzEvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_2/rnn_1/while/enter/_57", "op": "Enter", "input": ["819"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_2/rnn_1/while/enter/_62", "op": "Enter", "input": ["813"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzEvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_2/rnn_1/while/enter/_60", "op": "Enter", "input": ["807"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzEvd2hpbGU="}, "is_constant": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_1/while/enter/_56", "op": "Enter", "input": ["809"], "attr": {"T": {"type": "DT_FLOAT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzEvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_2/rnn_1/while/enter/_61", "op": "Enter", "input": ["811"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzEvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_2/rnn_1/while/enter/_64", "op": "Enter", "input": ["817"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzEvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_2/rnn_1/while/enter/_54", "op": "Enter", "input": ["PartitionedCall/model_2/rnn_1/time"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzEvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn_1/TensorArrayV2_1", "op": "TensorListReserve", "input": ["PartitionedCall/model_2/rnn_1/TensorArrayV2_1/element_shape", "PartitionedCall/model_2/rnn_1/strided_slice"], "attr": {"element_dtype": {"type": "DT_FLOAT"}, "shape_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "PartitionedCall/model_2/rnn_1/while/enter/_58", "op": "Enter", "input": ["PartitionedCall/model_2/rnn_1/strided_slice"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzEvd2hpbGU="}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_2/rnn_1/while/enter/_52", "op": "Enter", "input": ["PartitionedCall/model_2/rnn_1/while/loop_counter"], "attr": {"T": {"type": "DT_INT32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzEvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_2/rnn_3/while/enter/_210", "op": "Enter", "input": ["839"], "attr": {"T": {"type": "DT_FLOAT"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzMvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_2/rnn_3/while/enter/_206", "op": "Enter", "input": ["841"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzMvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_3/while/enter/_211", "op": "Enter", "input": ["843"], "attr": {"parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzMvd2hpbGU="}, "T": {"type": "DT_FLOAT"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_2/rnn_3/while/enter/_214", "op": "Enter", "input": ["849"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzMvd2hpbGU="}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_3/while/enter/_204", "op": "Enter", "input": ["PartitionedCall/model_2/rnn_3/time"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzMvd2hpbGU="}}}, {"name": "PartitionedCall/model_2/rnn_3/TensorArrayV2_1", "op": "TensorListReserve", "input": ["PartitionedCall/model_2/rnn_3/TensorArrayV2_1/element_shape", "PartitionedCall/model_2/rnn_3/strided_slice"], "attr": {"shape_type": {"type": "DT_INT32"}, "element_dtype": {"type": "DT_FLOAT"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_ARRAY", "args": [{"typeId": "TFT_TENSOR", "args": [{"typeId": "TFT_FLOAT"}]}]}]}}, {"name": "PartitionedCall/model_2/rnn_3/while/enter/_208", "op": "Enter", "input": ["PartitionedCall/model_2/rnn_3/strided_slice"], "attr": {"T": {"type": "DT_INT32"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzMvd2hpbGU="}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_2/rnn_3/while/enter/_202", "op": "Enter", "input": ["PartitionedCall/model_2/rnn_3/while/loop_counter"], "attr": {"frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzMvd2hpbGU="}, "parallel_iterations": {"i": "32"}, "T": {"type": "DT_INT32"}, "is_constant": {"b": false}}}, {"name": "PartitionedCall/model_2/tf.nn.convolution/convolution", "op": "Conv2D", "input": ["x", "779"], "device": "/device:CPU:0", "attr": {"use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "explicit_paddings": {"list": {}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "PartitionedCall/model_2/rnn_2/while/merge/_304", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_2/while/enter/_290", "PartitionedCall/model_2/rnn_2/while/next_iteration/_349"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/merge/_302", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_2/while/enter/_288", "PartitionedCall/model_2/rnn_2/while/next_iteration/_347"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/merge/_296", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_2/while/enter/_282", "PartitionedCall/model_2/rnn_2/while/next_iteration/_341"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/merge/_301", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_2/while/enter/_287", "PartitionedCall/model_2/rnn_2/while/next_iteration/_346"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/merge/_299", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_2/while/enter/_285", "PartitionedCall/model_2/rnn_2/while/next_iteration/_344"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/merge/_295", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_2/while/enter/_281", "PartitionedCall/model_2/rnn_2/while/next_iteration/_340"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/merge/_300", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_2/while/enter/_286", "PartitionedCall/model_2/rnn_2/while/next_iteration/_345"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/merge/_303", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_2/while/enter/_289", "PartitionedCall/model_2/rnn_2/while/next_iteration/_348"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/merge/_293", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_2/while/enter/_279", "PartitionedCall/model_2/rnn_2/while/next_iteration/_338"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/enter/_280", "op": "Enter", "input": ["PartitionedCall/model_2/rnn_2/TensorArrayV2_1"], "attr": {"is_constant": {"b": false}, "T": {"type": "DT_VARIANT"}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzIvd2hpbGU="}}}, {"name": "PartitionedCall/model_2/rnn_2/while/merge/_297", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_2/while/enter/_283", "PartitionedCall/model_2/rnn_2/while/next_iteration/_342"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/merge/_291", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_2/while/enter/_277", "PartitionedCall/model_2/rnn_2/while/next_iteration/_336"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn_3/while/merge/_229", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_3/while/enter/_215", "PartitionedCall/model_2/rnn_3/while/next_iteration/_274"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_3/while/merge/_227", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_3/while/enter/_213", "PartitionedCall/model_2/rnn_3/while/next_iteration/_272"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn_3/while/merge/_221", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_3/while/enter/_207", "PartitionedCall/model_2/rnn_3/while/next_iteration/_266"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn_3/while/merge/_226", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_3/while/enter/_212", "PartitionedCall/model_2/rnn_3/while/next_iteration/_271"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn/while/merge/_154", "op": "Merge", "input": ["PartitionedCall/model_2/rnn/while/enter/_140", "PartitionedCall/model_2/rnn/while/next_iteration/_199"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn/while/merge/_152", "op": "Merge", "input": ["PartitionedCall/model_2/rnn/while/enter/_138", "PartitionedCall/model_2/rnn/while/next_iteration/_197"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn/while/merge/_146", "op": "Merge", "input": ["PartitionedCall/model_2/rnn/while/enter/_132", "PartitionedCall/model_2/rnn/while/next_iteration/_191"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn/while/merge/_151", "op": "Merge", "input": ["PartitionedCall/model_2/rnn/while/enter/_137", "PartitionedCall/model_2/rnn/while/next_iteration/_196"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn/while/merge/_149", "op": "Merge", "input": ["PartitionedCall/model_2/rnn/while/enter/_135", "PartitionedCall/model_2/rnn/while/next_iteration/_194"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn/while/merge/_145", "op": "Merge", "input": ["PartitionedCall/model_2/rnn/while/enter/_131", "PartitionedCall/model_2/rnn/while/next_iteration/_190"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn/while/merge/_150", "op": "Merge", "input": ["PartitionedCall/model_2/rnn/while/enter/_136", "PartitionedCall/model_2/rnn/while/next_iteration/_195"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn/while/merge/_153", "op": "Merge", "input": ["PartitionedCall/model_2/rnn/while/enter/_139", "PartitionedCall/model_2/rnn/while/next_iteration/_198"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn/while/merge/_143", "op": "Merge", "input": ["PartitionedCall/model_2/rnn/while/enter/_129", "PartitionedCall/model_2/rnn/while/next_iteration/_188"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn/while/enter/_130", "op": "Enter", "input": ["PartitionedCall/model_2/rnn/TensorArrayV2_1"], "attr": {"T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uL3doaWxl"}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_2/rnn/while/merge/_147", "op": "Merge", "input": ["PartitionedCall/model_2/rnn/while/enter/_133", "PartitionedCall/model_2/rnn/while/next_iteration/_192"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn/while/merge/_141", "op": "Merge", "input": ["PartitionedCall/model_2/rnn/while/enter/_127", "PartitionedCall/model_2/rnn/while/next_iteration/_186"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}}}, {"name": "PartitionedCall/model_2/rnn_1/while/merge/_79", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_1/while/enter/_65", "PartitionedCall/model_2/rnn_1/while/next_iteration/_124"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_1/while/merge/_77", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_1/while/enter/_63", "PartitionedCall/model_2/rnn_1/while/next_iteration/_122"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn_1/while/merge/_71", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_1/while/enter/_57", "PartitionedCall/model_2/rnn_1/while/next_iteration/_116"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn_1/while/merge/_76", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_1/while/enter/_62", "PartitionedCall/model_2/rnn_1/while/next_iteration/_121"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_1/while/merge/_74", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_1/while/enter/_60", "PartitionedCall/model_2/rnn_1/while/next_iteration/_119"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_1/while/merge/_70", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_1/while/enter/_56", "PartitionedCall/model_2/rnn_1/while/next_iteration/_115"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn_1/while/merge/_75", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_1/while/enter/_61", "PartitionedCall/model_2/rnn_1/while/next_iteration/_120"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn_1/while/merge/_78", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_1/while/enter/_64", "PartitionedCall/model_2/rnn_1/while/next_iteration/_123"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn_1/while/merge/_68", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_1/while/enter/_54", "PartitionedCall/model_2/rnn_1/while/next_iteration/_113"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn_1/while/enter/_55", "op": "Enter", "input": ["PartitionedCall/model_2/rnn_1/TensorArrayV2_1"], "attr": {"T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "parallel_iterations": {"i": "32"}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzEvd2hpbGU="}}}, {"name": "PartitionedCall/model_2/rnn_1/while/merge/_72", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_1/while/enter/_58", "PartitionedCall/model_2/rnn_1/while/next_iteration/_117"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn_1/while/merge/_66", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_1/while/enter/_52", "PartitionedCall/model_2/rnn_1/while/next_iteration/_111"], "attr": {"T": {"type": "DT_INT32"}, "_has_manual_control_dependencies": {"b": true}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn_3/while/merge/_224", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_3/while/enter/_210", "PartitionedCall/model_2/rnn_3/while/next_iteration/_269"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_3/while/merge/_220", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_3/while/enter/_206", "PartitionedCall/model_2/rnn_3/while/next_iteration/_265"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_3/while/merge/_225", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_3/while/enter/_211", "PartitionedCall/model_2/rnn_3/while/next_iteration/_270"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_3/while/merge/_228", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_3/while/enter/_214", "PartitionedCall/model_2/rnn_3/while/next_iteration/_273"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_3/while/merge/_218", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_3/while/enter/_204", "PartitionedCall/model_2/rnn_3/while/next_iteration/_263"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn_3/while/enter/_205", "op": "Enter", "input": ["PartitionedCall/model_2/rnn_3/TensorArrayV2_1"], "attr": {"T": {"type": "DT_VARIANT"}, "is_constant": {"b": false}, "frame_name": {"s": "UGFydGl0aW9uZWRDYWxsL21vZGVsXzIvcm5uXzMvd2hpbGU="}, "parallel_iterations": {"i": "32"}}}, {"name": "PartitionedCall/model_2/rnn_3/while/merge/_222", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_3/while/enter/_208", "PartitionedCall/model_2/rnn_3/while/next_iteration/_267"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn_3/while/merge/_216", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_3/while/enter/_202", "PartitionedCall/model_2/rnn_3/while/next_iteration/_261"], "attr": {"T": {"type": "DT_INT32"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/tf.math.add/Add", "op": "AddV2", "input": ["PartitionedCall/model_2/tf.nn.convolution/convolution", "781"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/merge/_294", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_2/while/enter/_280", "PartitionedCall/model_2/rnn_2/while/next_iteration/_339"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/cond/_275/model_2/rnn_2/while/Less", "op": "Less", "input": ["PartitionedCall/model_2/rnn_2/while/merge/_293", "PartitionedCall/model_2/rnn_2/while/merge/_297", "^PartitionedCall/model_2/rnn_2/while/merge/_291"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn/while/merge/_144", "op": "Merge", "input": ["PartitionedCall/model_2/rnn/while/enter/_130", "PartitionedCall/model_2/rnn/while/next_iteration/_189"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn/while/cond/_125/model_2/rnn/while/Less", "op": "Less", "input": ["PartitionedCall/model_2/rnn/while/merge/_143", "PartitionedCall/model_2/rnn/while/merge/_147", "^PartitionedCall/model_2/rnn/while/merge/_141"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn_1/while/merge/_69", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_1/while/enter/_55", "PartitionedCall/model_2/rnn_1/while/next_iteration/_114"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_VARIANT"}}}, {"name": "PartitionedCall/model_2/rnn_1/while/cond/_50/model_2/rnn_1/while/Less", "op": "Less", "input": ["PartitionedCall/model_2/rnn_1/while/merge/_68", "PartitionedCall/model_2/rnn_1/while/merge/_72", "^PartitionedCall/model_2/rnn_1/while/merge/_66"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/rnn_3/while/merge/_219", "op": "Merge", "input": ["PartitionedCall/model_2/rnn_3/while/enter/_205", "PartitionedCall/model_2/rnn_3/while/next_iteration/_264"], "attr": {"T": {"type": "DT_VARIANT"}, "N": {"i": "2"}}}, {"name": "PartitionedCall/model_2/rnn_3/while/cond/_200/model_2/rnn_3/while/Less", "op": "Less", "input": ["PartitionedCall/model_2/rnn_3/while/merge/_218", "PartitionedCall/model_2/rnn_3/while/merge/_222", "^PartitionedCall/model_2/rnn_3/while/merge/_216"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "PartitionedCall/model_2/tf.nn.max_pool2d/MaxPool2d", "op": "MaxPool", "input": ["PartitionedCall/model_2/tf.math.add/Add"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "T": {"type": "DT_FLOAT"}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "padding": {"s": "VkFMSUQ="}}}, {"name": "PartitionedCall/model_2/rnn_2/while/LoopCond/_305", "op": "LoopCond", "input": ["PartitionedCall/model_2/rnn_2/while/cond/_275/model_2/rnn_2/while/Less"]}, {"name": "PartitionedCall/model_2/rnn/while/LoopCond/_155", "op": "LoopCond", "input": ["PartitionedCall/model_2/rnn/while/cond/_125/model_2/rnn/while/Less"]}, {"name": "PartitionedCall/model_2/rnn_1/while/LoopCond/_80", "op": "LoopCond", "input": ["PartitionedCall/model_2/rnn_1/while/cond/_50/model_2/rnn_1/while/Less"]}, {"name": "PartitionedCall/model_2/rnn_3/while/LoopCond/_230", "op": "LoopCond", "input": ["PartitionedCall/model_2/rnn_3/while/cond/_200/model_2/rnn_3/while/Less"]}, {"name": "PartitionedCall/model_2/tf.nn.relu/Relu", "op": "Relu", "input": ["PartitionedCall/model_2/tf.nn.max_pool2d/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/Func/PartitionedCall/input/_46_switch/_319", "op": "Switch", "input": ["PartitionedCall/model_2/rnn_2/while/merge/_304", "PartitionedCall/model_2/rnn_2/while/LoopCond/_305"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/Func/PartitionedCall/input/_43_switch/_317", "op": "Switch", "input": ["PartitionedCall/model_2/rnn_2/while/merge/_302", "PartitionedCall/model_2/rnn_2/while/LoopCond/_305"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/Func/PartitionedCall/input/_45_switch/_311", "op": "Switch", "input": ["PartitionedCall/model_2/rnn_2/while/merge/_296", "PartitionedCall/model_2/rnn_2/while/LoopCond/_305"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/Func/PartitionedCall/input/_42_switch/_316", "op": "Switch", "input": ["PartitionedCall/model_2/rnn_2/while/merge/_301", "PartitionedCall/model_2/rnn_2/while/LoopCond/_305"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/Func/PartitionedCall/input/_39_switch/_314", "op": "Switch", "input": ["PartitionedCall/model_2/rnn_2/while/merge/_299", "PartitionedCall/model_2/rnn_2/while/LoopCond/_305"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/Func/PartitionedCall/input/_40_switch/_310", "op": "Switch", "input": ["PartitionedCall/model_2/rnn_2/while/merge/_295", "PartitionedCall/model_2/rnn_2/while/LoopCond/_305"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/Func/PartitionedCall/input/_41_switch/_315", "op": "Switch", "input": ["PartitionedCall/model_2/rnn_2/while/merge/_300", "PartitionedCall/model_2/rnn_2/while/LoopCond/_305"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/Func/PartitionedCall/input/_44_switch/_318", "op": "Switch", "input": ["PartitionedCall/model_2/rnn_2/while/merge/_303", "PartitionedCall/model_2/rnn_2/while/LoopCond/_305"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "PartitionedCall/model_2/rnn_2/while/PartitionedCall/model_2/rnn_2/time_switch/_308", "op": "Switch", "input": ["PartitionedCall/model_2/rnn_2/while/merge/_293", "PartitionedCall/model_2/rnn_2/while/LoopCond/_305"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": 